# 김형택은 지금 몰래 Spider Solitaire(스파이더 카드놀이)를 하고 있다. 형택이는 이 게임을 이길 때도 있었지만, 질 때도 있었다. 누군가의 시선이 느껴진 형택이는 게임을 중단하고 코딩을 하기 시작했다. 의심을 피했다고 생각한 형택이는 다시 게임을 켰다. 그 때 형택이는 잠시 코딩을 하는 사이에 자신의 게임 실력이 눈에 띄게 향상된 것을 알았다.

# 이제 형택이는 앞으로의 모든 게임에서 지지 않는다. 하지만, 형택이는 게임 기록을 삭제 할 수 없기 때문에, 자신의 못하던 예전 기록이 현재 자신의 엄청난 실력을 증명하지 못한다고 생각했다.

# 게임 기록은 다음과 같이 생겼다.

# 게임 횟수 : X
# 이긴 게임 : Y (Z%)
# Z는 형택이의 승률이고, 소수점은 버린다. 예를 들어, X=53, Y=47이라면, Z=88이다.
# X와 Y가 주어졌을 때, 형택이가 게임을 최소 몇 번 더 해야 Z가 변하는지 구하는 프로그램을 작성하시오.

# 입력
# 각 줄에 정수 X와 Y가 주어진다.

# 출력
# 첫째 줄에 형택이가 게임을 최소 몇 판 더 해야하는지 출력한다. 만약 Z가 절대 변하지 않는다면 -1을 출력한다.

# 제한
# 1 ≤ X ≤ 1,000,000,000
# 0 ≤ Y ≤ X
# 예제 입력 1 
# 10 8
# 예제 출력 1 
# 1
# 예제 입력 2 
# 100 80
# 예제 출력 2 
# 6

import sys;input= sys.stdin.readline
x,y = map(int, input().split())
z = ( y * 100) //x #부동소수점 오차로인해 (y/x)*100 대신 수식 사용.
if z >= 99:
    print(-1)  #확률이 99가 넘어갈경우 절대로 100이 될수없음.
else:
    count=0; l=1; r=x
    while l <= r: #이분탐색 사용
        mid = (l+r) //2
        if (y+mid)* 100 // (x+mid ) <= z:
            l = mid+1
        else:
            count = mid
            r = mid - 1
    print(count)
